app/controllers/character_sheets_controller.rb

SELECT "character_sheets".* FROM "character_sheets"
---
  def index
    @character_sheets = CharacterSheet.all

INSERT INTO "character_sheets" ("CharacterName", "created_at", "updated_at") VALUES (?, ?, ?)  [["CharacterName", "Test"], ["created_at", "2015-07-24 04:31:03.071412"], ["updated_at", "2015-07-24 04:31:03.071412"]]
---
  def create
    @character_sheet = CharacterSheet.new(character_sheet_params)

    respond_to do |format|
      if @character_sheet.save

SELECT  "character_sheets".* FROM "character_sheets"  WHERE "character_sheets"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_character_sheet
      @character_sheet = CharacterSheet.find(params[:id])